2021-2023/TNCO/Packages/rfs_devicemanagement_ansible/Contains/devicemanagement_rfs/Lifecycle/ansible/roles/BlackListDevice/templates/nokia_blocklist_device_request.xml.j2

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Body>
		<spml:addRequest timestamp="true" requestID="{{ extOrderId }}" xmlns:spml="urn:siemens:names:prov:gw:SPML:2:0" xmlns:dev="urn:siemens:names:prov:gw:EIR_NSR:1:0">
			<version>EIR_NSR_v30</version>
			<object xsi:type="dev:Device">
            		<identifier>{{ PEI }}</identifier>
				<colour>
					<colour>{{ ColouredList }}</colour>
					<reason>00{{ GSMACode }}</reason>
					<organization>313/PLMN/034000</organization>
					<clarifyReason>{{ GSMAReason }}</clarifyReason>
				</colour>
			</object>
		</spml:addRequest>
	</soapenv:Body>
</soapenv:Envelope>